modm-ext/data.modm.io/docs/svd/header_stm32u335xx.svd
        <register>
          <name>TISEL</name>
          <description>TIM Input Selection register</description>
          <addressOffset>0x5c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TI1SEL</name>
              <description>TI1SEL[3:0] bits (TIM1 TI1 SEL)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>TI2SEL</name>
              <description>TI2SEL[3:0] bits (TIM1 TI2 SEL)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>TI3SEL</name>
              <description>TI3SEL[3:0] bits (TIM1 TI3 SEL)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>TI4SEL</name>
              <description>TI4SEL[3:0] bits (TIM1 TI4 SEL)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AF1</name>
          <description>TIM alternate function option register 1</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BKINE</name>
              <description>BRK BKIN input enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BKCMP1E</name>
              <description>BRK CMP1 enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BKCMP2E</name>
              <description>BRK CMP2 enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BKINP</name>
              <description>BRK BKIN input polarity</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BKCMP1P</name>
              <description>BRK CMP1 input polarity</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BKCMP2P</name>
              <description>BRK CMP2 input polarity</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AF2</name>
          <description>TIM alternate function option register 2</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BK2INE</name>
              <description>BRK2 BKIN input enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BK2CMP1E</name>
              <description>BRK2 CMP1 enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BK2CMP2E</name>
              <description>BRK2 CMP2 enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BK2INP</name>
              <description>BRK2 BKIN input polarity</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BK2CMP1P</name>
              <description>BRK2 CMP1 input polarity</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BK2CMP2P</name>
              <description>BRK2 CMP2 input polarity</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OR1</name>
          <description>TIM option register</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HSE32EN</name>
              <description>HSE/32 clock enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAR</name>
          <description>TIM DMA address for full transfer</description>
          <addressOffset>0x3e0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DMAB</name>
              <description>DMA register for burst accesses</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="TIM6">
      <name>TIM7</name>
      <description>TIM</description>
      <baseAddress>0x40001400</baseAddress>
      <interrupt>
        <name>TIM7</name>
        <description>TIM7 global interrupt</description>
        <value>50</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>WWDG</name>
      <description>WWDG</description>
      <baseAddress>0x40002c00</baseAddress>
      <interrupt>
        <name>WWDG</name>
        <description>Window WatchDog interrupt</description>
        <value>0</value>
      </interrupt>
      <registers>
        <register>
          <name>CR</name>
          <description>WWDG Control register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>T</name>
              <description>T[6:0] bits (7-Bit counter (MSB to LSB))</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>WDGA</name>
              <description>Activation bit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFR</name>
          <description>WWDG Configuration register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>W</name>
              <description>W[6:0] bits (7-bit window value)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>EWI</name>
              <description>Early Wakeup Interrupt</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WDGTB</name>
              <description>WDGTB[2:0] bits (Timer Base)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PRESCALER_1</name>
                  <description>WWDG counter clock = (PCLK1/4096)/1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALER_2</name>
                  <description>WWDG counter clock = (PCLK1/4096)/2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALER_4</name>
                  <description>WWDG counter clock = (PCLK1/4096)/4</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALER_8</name>
                  <description>WWDG counter clock = (PCLK1/4096)/8</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALER_16</name>
                  <description>WWDG counter clock = (PCLK1/4096)/16</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALER_32</name>
                  <description>WWDG counter clock = (PCLK1/4096)/32</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALER_64</name>
                  <description>WWDG counter clock = (PCLK1/4096)/64</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALER_128</name>
                  <description>WWDG counter clock = (PCLK1/4096)/128</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>WWDG Status register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EWIF</name>
              <description>Early Wakeup Interrupt Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
