modm-ext/data.modm.io/docs/svd/header_stm32u335xx.svd
        <register>
          <name>AHB1STPENR1</name>
          <description>AHB1 Peripherals Clock Enable in Stop Mode Register 1</description>
          <addressOffset>0xd8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>GPDMA1STPEN</name>
              <description>GPDMA1 Clock Enable in Stop Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADF1STPEN</name>
              <description>ADF1 Clock Enable in Stop Mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLASHSTPEN</name>
              <description>FLASH Clock Enable in Stop Mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RAMCFGSTPEN</name>
              <description>RAMCFG Clock Enable in Stop Mode</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GTZC1STPEN</name>
              <description>GTZC1 Clock Enable in Stop Mode</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM1STPEN</name>
              <description>SRAM1 Clock Enable in Stop Mode</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AHB2STPENR1</name>
          <description>AHB2 Peripherals Clock Enable in Stop Mode Register 1</description>
          <addressOffset>0xdc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>GPIOASTPEN</name>
              <description>IO port A Clock Enable in Stop Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPIOBSTPEN</name>
              <description>IO port B Clock Enable in Stop Mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPIOCSTPEN</name>
              <description>IO port C Clock Enable in Stop Mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPIODSTPEN</name>
              <description>IO port D Clock Enable in Stop Mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPIOHSTPEN</name>
              <description>IO port H Clock Enable in Stop Mode</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DAC1STPEN</name>
              <description>DAC1 Clock Enable in Stop Mode</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM2STPEN</name>
              <description>SRAM2 Clock Enable in Stop Mode</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>APB1STPENR1</name>
          <description>APB1 Peripherals Clock Enable in Stop Mode Register 1</description>
          <addressOffset>0xec</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SPI2STPEN</name>
              <description>SPI2 Clock Enable in Stop Mode</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USART3STPEN</name>
              <description>USART3 Clock Enable in Stop Mode</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UART4STPEN</name>
              <description>UART4 Clock Enable in Stop Mode</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C1STPEN</name>
              <description>I2C1 Clock Enable in Stop Mode</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I3C1STPEN</name>
              <description>I3C1 Clock Enable in Stop Mode</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OPAMPSTPEN</name>
              <description>OPAMP Clock Enable in Stop Mode</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RTCAPBSTPEN</name>
              <description>RTCAPB Clock Enable in Stop Mode</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>APB1STPENR2</name>
          <description>APB1 Peripherals Clock Enable in Stop Mode Register 2</description>
          <addressOffset>0xf0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LPTIM2STPEN</name>
              <description>LPTIM2 Clock Enable in Stop Mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2STPENR</name>
          <description>APB2 Peripherals Clock Enable in Stop Mode Register</description>
          <addressOffset>0xf4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SPI1STPEN</name>
              <description>SPI1 Clock Enable in Stop Mode</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USART1STPEN</name>
              <description>USART1 Clock Enable in Stop Mode</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USB1STPEN</name>
              <description>USB1 Clock Enable in Stop Mode</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>APB3STPENR</name>
          <description>APB3 Peripherals Clock Enable in Stop Mode Register</description>
          <addressOffset>0xf8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LPUART1STPEN</name>
              <description>LPUART1 Clock Enable in Stop Mode</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C3STPEN</name>
              <description>I2C3 Clock Enable in Stop Mode</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPTIM1STPEN</name>
              <description>LPTIM1 Clock Enable in Stop Mode</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPTIM3STPEN</name>
              <description>LPTIM3 Clock Enable in Stop Mode</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPTIM4STPEN</name>
              <description>LPTIM4 Clock Enable in Stop Mode</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMPSTPEN</name>
              <description>COMP Clock Enable in Stop Mode</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CCIPR1</name>
          <description>Peripherals Independent Clocks Configuration Register 1</description>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>USART1SEL</name>
              <description>USART1SEL: USART1 Kernel Clock Source Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USART3SEL</name>
              <description>USART3SEL: USART3 Kernel Clock Source Selection</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UART4SEL</name>
              <description>UART4SEL: UART4 Kernel Clock Source Selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I3C1SEL</name>
              <description>I3C1SEL: I3C1 Kernel Clock Source Selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C1SEL</name>
              <description>I2C1SEL: I2C1 Kernel Clock Source Selection</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPI2SEL</name>
              <description>SPI2SEL: SPI2 Kernel Clock Source Selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPTIM2SEL</name>
              <description>LPTIM2SEL[1:0]: LPTIM2 Kernel Clock Source Selection</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SPI1SEL</name>
              <description>SPI1SEL: SPI1 Kernel Clock Source Selection</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SYSTICKSEL</name>
              <description>SYSTICKSEL[1:0]: SYSTICK Clock Source Selection</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>FDCANSEL</name>
              <description>FDCANSEL: FDCAN1 Kernel Clock Source Selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ICLKSEL</name>
              <description>ICLKSEL[1:0]: Intermediate Clock Source Selection</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>USB1SEL</name>
              <description>USB1SEL: USB1 Kernel Clock Source Selection</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMICSEL</name>
              <description>TIMICSEL[2:0]: TIM16, TIM17 and LPTIM2 Internal Input Capture Kernel Clock Source Selection</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CCIPR2</name>
          <description>Peripherals Independent Clocks Configuration Register 2</description>
          <addressOffset>0x104</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ADF1SEL</name>
              <description>ADF1SEL[1:0]: ADF Kernel Clock Source Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>RNGSEL</name>
              <description>RNGSEL: RNG Kernel Clock Source Selection</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADCDACPRE</name>
              <description>ADCDACPRE[3:0]: ADC/DAC prescaler</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ADCDACSEL</name>
              <description>ADCDACSEL[2:0]: ADC1 and DAC1 Kernel Clock Source Selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DAC1SHSEL</name>
              <description>DACSEL: DAC1 Sample and Hold Clock Source Selection</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OCTOSPISEL</name>
              <description>OCTOSPISEL: OCTOSPI1 Kernel Clock Source Selection</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CCIPR3</name>
          <description>Peripherals Independent Clocks Configuration Register 3</description>
          <addressOffset>0x108</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LPUART1SEL</name>
              <description>LPUART1SEL[1:0]: LPUART1 Kernel Clock Source Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>I2C3SEL</name>
              <description>I2C3SEL: I2C3 Kernel Clock Source Selection</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPTIM34SEL</name>
              <description>LPTIM34SEL[1:0]: LPTIM3 and LPTIM4 Kernel Clock Source Selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>LPTIM1SEL</name>
              <description>LPTIM1SEL[1:0]: LPTIM1 Kernel Clock Source Selection</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BDCR</name>
          <description>Backup Domain Control Register</description>
          <addressOffset>0x110</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LSEON</name>
              <description>LSE Oscillator Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LSERDY</name>
              <description>LSE Oscillator Ready</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LSEBYP</name>
              <description>LSE Oscillator Bypass</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LSEDRV</name>
              <description>LSEDRV[1:0]: LSE Oscillator Drive Capability</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Xtal mode lower driving capability</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MEDIUMLOW</name>
                  <description>Xtal mode medium low driving capability</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MEDIUMHIGH</name>
                  <description>Xtal mode medium high driving capability</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>Xtal mode higher driving capability</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LSECSSON</name>
              <description>CSS on LSE Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LSECSSD</name>
              <description>CSS on LSE failure Detection</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LSESYSEN</name>
              <description>LSE System Clock (LSESYS) Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RTCSEL</name>
              <description>RTCSEL[1:0]: RTC Clock Source Selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No clock used as RTC clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LSE</name>
                  <description>LSE oscillator clock used as RTC clock</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LSI</name>
                  <description>LSI oscillator clock used as RTC clock</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV32</name>
                  <description>HSE oscillator clock divided by 32 used as RTC clock</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LSESYSRDY</name>
              <description>LSE System Clock (LSESYS) Ready</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LSEGFON</name>
              <description>LSE Clock Glitch Filter Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RTCEN</name>
              <description>RTC Clock Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BDRST</name>
              <description>BD reset</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LSCOEN</name>
              <description>Low-speed Clock Output (LSCO) Enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LSCOSEL</name>
              <description>Low-speed Clock Output Selection</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LSI</name>
                  <description>LSI selection for low speed clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LSE</name>
                  <description>LSE selection for low speed clock</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
